import { nanoid } from "nanoid";

export const initialBooks = [
  {
    id: nanoid(),
    bookName: "סודות בית השמפניה",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2020/new_winemakers_master.jpg",
    summary: "סיפור קורע לב על החלטה אחת שמשנה חיים שלמים",
    price: 60.5,
    discount: 0,
    priceAfterDiscount: 60.5,
  },
  {
    id: nanoid(),
    bookName: "המכתב האבוד",
    author: "ג'יליאן קנטור",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2018/letter_master(1).jpg",
    summary:
      "זהו רומן היסטורי שעלילתו מתפצלת לשני קווים מקבילים, ומתפרשת מאוסטריה שלקראת מלחמת העולם השנייה ועד ללוס אנג’לס של שנות התשעים.",
    price: 120,
    discount: 0,
    priceAfterDiscount: 120,
  },
  {
    id: nanoid(),
    bookName: "מכתב שנשכח",
    author: "קתרין יוז",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2018/letter_master.jpg",
    summary:
      "טינה קרייג לא מוותרת על התנדבות שבועית בחנות הצדקה לבגדים משומשים. במנצ´סטר של שנות השבעים, זהו מקום המפלט היחיד שלה מהבית בו שוכב בעלה מעולף בסלון אחרי עוד לילה של שתייה לשוכרה. ",
    price: 95,
    discount: 0,
    priceAfterDiscount: 95,
  },
  {
    id: nanoid(),
    bookName: "יער הכוכבים הנמוגים",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/28119/forest_Master.jpg",
    summary:
      "יונה, שנולדה בשם אינגה, לא זוכרת הרבה מהוריה או מהעולם שמחוץ ליער. כשהיתה בת שנתיים, היא נגנבה מהוריה הגרמנים על ידי קשישה יהודייה בשם ירושה, שראתה את הנסתר וחשה שהיא חייבת לקחת את הילדה מחיק משפחתה אל היער.",
    price: 65,
    discount: 0,
    priceAfterDiscount: 65,
  },
  {
    id: nanoid(),
    bookName: "צופן דה וינצ׳י",
    author: "דן בראון",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2017/_master(21).jpg",
    summary:
      "בעת ביקור בפריז מקבל רוברט לנגדון, מומחה לסמלים, טלפון בהול בשעת לילה מאוחרת. האוצֵר הזקן של הלובר נרצח במוזיאון, וצופן סתום נמצא ליד גופתו. כשלנגדון מנסה לפענח את החידות המוזרות בעזרת מפענחת הצפנים סופי נווה, נדהמים שניהם לגלות שורה של רמזים ביצירותיו של דה וינצ'י, שהוסוו בחכמה על ידי הצייר.",
    price: 55,
    discount: 0,
    priceAfterDiscount: 55,
  },
  {
    id: nanoid(),
    bookName: "הגשרים של מחוז מדיסון",
    author: "רוברט ג'יימס וולר",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2019_b/medison_master.jpg",
    summary:
      "הגשרים של מחוז מדיסון מאת רוברט ג'יימס וולר ראה אור לראשונה ב-1992, והיה לתופעה. בתוך זמן קצר, הפך לאחד מרבי המכר הגדולים של המאה העשרים: 60 מיליון עותקים נמכרו ממנו ברחבי העולם, ב-40 שפות שונות. הספר כיכב במקום הראשון ברשימת רבי המכר של הניו-יורק טיימס, ונותר בה שלוש שנים ברציפות. והיה כמובן גם הסרט המצליח, בכיכובם של קלינט איסטווד ומריל סטריפ. ",
    price: 50,
    discount: 0,
    priceAfterDiscount: 50,
  },
  {
    id: nanoid(),
    bookName: "אורח באחוזת פארלי",
    author: "ריס בואן",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/32131/orech_beachozat_ferlie_Master.jpg",
    summary:
      "מלחמת העולם השנייה מגיעה לאחוזת פארלי, מקום מושבם של לורד וסטרהאם וחמש בנותיו, כאשר חייל עם מצנח פגום נופל אל מותו בשטחה. המדים והציוד שלו מעוררים חשד, וקצין MI5 וחבר המשפחה בן קרסוול לוקח על עצמו בחשאי את המשימה להכריע אם מדובר במרגל גרמני. המשימה גם מעניקה לו הזדמנות להימצא בקרבתה של פמלה, בתו האמצעית של לורד וסטרהאם, שבה הוא מאוהב בחשאי. אך לפמלה יש סוד משלה: היא התקבלה לעבודה בבלצ'לי פארק, מקום משכנה של היחידה הבריטית לפיצוח צפנים.",
    price: 76,
    discount: 0,
    priceAfterDiscount: 76,
  },
  {
    id: nanoid(),
    bookName: "ספר השמות האבודים",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/24415/lostNames_Master.jpg",
    summary:
      "כשאווה טראוב אברמס, ספרנית על סף פרישה, מבחינה בוקר אחד בעיתון בתמונה של ספר שלא ראתה זה יותר משישים וחמש שנים – ספר השמות האבודים – מבטה קופא. מתברר שחוקרים מצאו את הספר ומתקשים לפענח את החידה הטמונה בו – חידה שרק אווה יודעת את פתרונה.",
    price: 68,
    discount: 0,
    priceAfterDiscount: 68,
  },
  {
    id: nanoid(),
    bookName: "דיו חיוור",
    author: "הרלן קובן",
    image:
      "https://images-evrit.yit.co.il/Images/Products/ebooks2/just_one_look_master.jpg",
    summary:
      "הרלן קובן, מחבר רבי-המכר עוצרי הנשימה הנעלמים וההזדמנות האחרונה, עושה זאת שוב, בספר שכבש בסערה את מצעדי המכירות בכל מקום בעולם שבו הופיע, וקיבע סופית את מעמדו של קובן כמלך הבלתי-מעורער של ספרות המתח האמריקאית. דיו חיוור הוא שם הלהיט הגדול של להקה שכמעט היתה לאגדה והתפרקה בנסיבות מסתוריות רגע לפני הפריצה קדימה. שנים רבות אחרי הקונצרט האחרון של הלהקה, שנגמר באסון, נסחפים חייהן של כמה דמויות למערבולת מסוכנת שאין ממנה מוצא. בעלה של גרייס לוסון נעלם.",
    price: 71,
    discount: 0,
    priceAfterDiscount: 71,
  },
  {
    id: nanoid(),
    bookName: "תמונות נסתרות",
    author: "ג׳ייסון רקולאק",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/28769/temunot_Master.jpg",
    summary:
      "תעלומה על צעירה שנאבקת בעברהּ, ועל ילד קטן עם סודות מוזרים ומטרידים. אחרי שנה וחצי במוסד גמילה, בעקבות תקרית טראגית והתמכרות למשככי כאבים, מלורי קווין נכונה לצאת ולפגוש את העולם שבחוץ. היא מתקבלת לעבודה כאומנת בביתם של טד וקרוליין, זוג צעיר ואמיד מאוד, הורים לטדי בן החמש.",
    price: 57,
    discount: 0,
    priceAfterDiscount: 57,
  },
  {
    id: nanoid(),
    bookName: "המפתח של שרה",
    author: "טטיאנה דה רוניי",
    image:
      "https://images-evrit.yit.co.il/Images/Products/newcovers/hamafteach_shel_sara_master.jpg",
    summary:
      "פריז, מאי 2002: לקראת מלוא שישים שנה לוול-ד'איב מתבקשת ג'וליה ג'רמונד, עיתונאית אמריקאית, לכתוב על היום השחור הזה בעברה של צרפת. ג'וליה, שנשואה לצרפתי ומתגוררת בפריז זה עשרים וחמש שנים, נדהמת לגלות כמה הכחשה אופפת את האירוע הזה. במהלך התחקיר שלה היא נתקלת בעקבותיו של סוד משפחתי ישן שמחבר אותה אל שרה, סוד בן שישים שנה שמאיים על נישואיה שלה.",
    price: 60,
    discount: 0,
    priceAfterDiscount: 60,
  },
  {
    id: nanoid(),
    bookName: "המכתבים הנסתרים",
    author: "לורנה קוק",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/33231/michtavim_Master.jpg",
    summary:
      "ענני המלחמה שמרחפים מעל שמי אירופה מתקרבים אל האחוזה רחבת הידיים של משפחת קאר-לאיון. העלמה הצעירה קרודיליה מנסה להסיח את דעתה מהדאגות באמצעות טיפול בגני האחוזה. עבודת הגינון מרגיעה ומסקרנת אותה, וכך גם הגנן החדש, אייזק. בין השניים מתפתח סיפור אהבה. זו אהבה סוחפת, ממכרת וסוערת, אולי דווקא משום שהיא אסורה. אייזק וקרודיליה שומרים על הרומן בסוד גם אחרי שאייזק מגוייס לצבא ונשלח לחזית. משם, הוא כותב לה מכתבים שמבטיחים עתיד משותף ומאושר. ",
    price: 101,
    discount: 0,
    priceAfterDiscount: 101,
  },
  {
    id: nanoid(),
    bookName: "הבת מפריז",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/31571/habat_meparis_Master.jpg",
    summary: `פריז, 1939. האמהות הצעירות אליס וג'ולייט נעשות חברות טובות לאחר שהן נפגשות יום אחד ביער בולון היפהפה. אף אחת מהן לא יכולה לחזות אז את הצל שתטיל המלחמה על צרפת וכיצד היא תטלטל את חייהן.

כשחייה של אליס נתונים בסכנה בגלל הנאצים, היא מפקידה אצל ג'ולייט את הדבר היקר לה ביותר בעולם – בתה הפעוטה. אבל שום מקום אינו בטוח במלחמה, אפילו לא חנות ספרים קטנה ושקטה כמו החנות של ג'ולייט ומשפחתה. וכשפצצה נופלת בשכונה, החנות ועולמה של ג׳ולייט נחרבים.`,
    price: 98,
    discount: 0,
    priceAfterDiscount: 98,
  },
  {
    id: nanoid(),
    bookName: "בלובירד",
    author: "ג'נבייב גרהאם",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/30935/Bluebird_Master.jpg",
    summary: `יום אחד הוא פשוט מופיע במקום העבודה שלה. גבר יפה, מלוכלך ומאובק, מחזיק חבילה בידו. קייסי פותחת את הצרור כמעט בחוסר עניין, ונדהמת. כאוצרת במוזיאון, היא בקושי מצליחה להסתיר את התרגשותה. הגבר היפה הביא איתו אוצר: בקבוק ויסקי עתיק ונדיר, שמצא טמון בקיר הבית שהוא משפץ. 

1918.
המלחמה הגדולה עדיין מתחוללת. אדל סוואר, אחות צעירה בבית חולים שדה בבלגיה, מטפלת בעדינות אין קץ בג'רי, החולה המיוחד שלה. משהו בו מרגש אותה. האם זאת העובדה שגילתה שאי אז, בקנדה הרחוקה, הם היו כמעט שכנים? לחרדתה, ג'רי הולך ונרפא ובעוד רגע ישוב לחזית. ואז? מה יהיה אז?`,
    price: 40,
    discount: 0,
    priceAfterDiscount: 40,
  },
  {
    id: nanoid(),
    bookName: "המטופלת השקטה",
    author: "אלכס מיכאלידס",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2019/silent_master.jpg",
    summary: `החיים של אלישה ברנסון נראים מושלמים. היא ציירת מפורסמת שנשואה לצלם אופנה מבוקש ומתגוררת בבית מידות בעל חלונות גדולים שנשקפים אל פארק באחד האזורים הנחשקים ביותר בלונדון. ערב אחד חוזר בעלה מאוחר מהעבודה, ואלישה יורה בו חמש פעמים בפנים, ומאותו רגע לא מוציאה מילה מהפה.
 
סירובה לדבר, או להעניק הסבר כלשהו למעשה, הופך את הטרגדיה המשפחתית לדבר מה גדול בהרבה, לפרשה שמציתה את דמיונו של הציבור והופכת את אלישה לדמות ידועה לשמצה. מחירי הציורים שלה מרקיעים שחקים, והיא, "המטופלת השקטה", מוסתרת מעיני הציבור והצהובונים בבית חולים פסיכיאטרי בצפון לונדון.`,
    price: 45,
    discount: 0,
    priceAfterDiscount: 45,
  },
  {
    id: nanoid(),
    bookName: "המתיקות שבשכחה",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/ebooks2/the_sweetness_of_forgetting_master.jpg",
    summary: `מאפיית "כוכב הצפון" שבקייפ קוד עוברת מאם לבת במשפחת מֶק'קנה זה שלושה דורות. מאז שהיא זוכרת את עצמה, ריח הקינמון והחמאה ומלאכת הערבוב והאפייה סיפקו להופ מק'קנה־סמית מזור ועוגן, ייעוד ונחמה. אולם לאחר גירושיה, דומה שהקסם פג. הקשיים הכלכליים, תובענותה של בתה המרדנית והטיפול בסבתה האהובה חולת האלצהיימר מאיימים להכריע את הופ, ולראשונה בחייה היא תוהה אם תוכל להמשיך להחזיק במאפייה.

משהו חייב להשתנות, והשינוי מגיע מכיוון בלתי־צפוי: ברגע של צלילות, חושפת רוז,  סבתה הדמנטית, סודות מעברה ושולחת אותה לפריז להתחקות אחר אותו עבר כשבאמתחתה רק רשימת שמות מסתורית. מסעה של הופ מוביל אותה דרך מסגד ובית כנסת אל סיפור שתחילתו בתקופת השואה, ואל אהבה הטומנת בחובה מסתורין רב. אם תאזור את האומץ להתמודד עם הסודות של משפחתה, עשויה הופ למצוא מחדש את האמון בעצמה ובדרך שבחרה.`,
    price: 87,
    discount: 0,
    priceAfterDiscount: 87,
  },
  {
    id: nanoid(),
    bookName: `הדירה ברחוב אמלי`,
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2019/new_room_master.jpg",
    summary: `
כשרובי הנדרסון נישאה לצרפתי מרסל בנואה, היא הייתה בטוחה שמצאה את האושר. היא עוזבת את קליפורניה ועוברת להתגורר בעיר חלומותיה פריז, בדירה ברחוב אמלי המשקיפה אל מגדל אייפל. אבל חייה החדשים והמאושרים מקבלים תפנית מטרידה עם פרוץ מלחמת העולם השנייה וכיבוש פריז בידי הגרמנים.
בצל ענני המלחמה יוצרת רובי קשרים אמיצים עם שרלוט, בת השכנים היהודיה, ויחד הן נשבעות לעשות כל שביכולתן על מנת לעזור לכוחות הטוב לנצח את כוחות הרשע. בתוך כך הן מגלות שגם באחת התקופות הקשות והאפלות בהיסטוריה, מצליחים האור והאהבה לחדור מבעד לסדקי החשיכה ולאחות לבבות שבורים. `,
    price: 75,
    discount: 0,
    priceAfterDiscount: 75,
  },
  {
    id: nanoid(),
    bookName: "הבציר האבוד",
    author: "אן מא",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2019_b/abazir_master.jpg",
      summary: `אישה חוזרת אל הכרם המשפחתי בבורגונדי וחושפת במפתיע יומן אבוד, בת-משפחה עלומה וסוד שהוסתר מאז מלחמת העולם השנייה.
קייט רוצה להצטרף לקבוצה המובחרת של מוסמכים ליין בעולם. לשם כך עליה לעבור את מבחן המאסטר ביין שאין קשה ממנו. חודשים ספורים לפני המבחן הגורלי היא נוסעת לבורגונדי לבלות את האביב באחוזה המשפחתית, שם תוכל להתמחות ביינות בורגונדי ולחדש את הקשר עם בן דודה ניקו ואשתו הת'ר, שמנהלים את הכרם והיקב. האדם האחד שקייט מקווה להתחמק ממנו הוא ז'אן-לוק, יינן צעיר ומוכשר ואהבתה הראשונה.`,
    price: 80,
    discount: 0,
    priceAfterDiscount: 80,
  },
  {
    id: nanoid(),
    bookName: "ההבטחה האסורה",
    author: "לורנה קוק",
    image: "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/25679/promise_Master.jpg",
    summary: `באירופה משתוללת מלחמת העולם השנייה, אבל בבית אינברמוריי הכל מתנהל על מי מנוחות. אלא שאז, בדיוק ביום הולדתה ה-21, דקות אחרי שהיא נמלטת מהמסיבה שלה עצמה, עומדת קונסטנס מול האגם הסמוך לביתה ולא מאמינה למראה עיניה. האם היא היחידה שראתה עכשיו מטוס צבאי מתרסק לתוך המים? האם תצליח להציל את הטייס? ומדוע מעשה שכזה ישנה את חייה לעד?`,
    price: 55,
    discount: 0,
    priceAfterDiscount: 55
  },
  {
    id: nanoid(),
    bookName: "הכפר האבוד",
    author: "לורנה קוק",
    image: "https://images-evrit.yit.co.il/Images/Products/covers_2020/lostvillage_master.jpg",
    summary: `כולם ידעו על הכפר האבוד. כולם הכירו את הסיפור. זה היה מאותם מקרים שאנשים מדברים עליהם שנים: לילה אחד, בעיצומה של מלחמת העולם השנייה, נאלצו תושבי הכפר הבריטי טיינהאם לעזוב את ביתם כשהם מותירים מאחור חיים שלמים – בתים מלאים ברהיטים, באוכל, בזיכרונות, בתמונות שמספרות מעט ומסתירות הרבה.`,
    price: 53,
    discount: 0,
    priceAfterDiscount: 53

  }
];
