import { nanoid } from "nanoid";

export const initialBooks = [
  {
    id: nanoid(),
    bookName: "סודות בית השמפניה",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2020/new_winemakers_master.jpg",
    summary: "סיפור קורע לב על החלטה אחת שמשנה חיים שלמים",
    price: 60.5,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "המכתב האבוד",
    author: "ג'יליאן קנטור",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2018/letter_master(1).jpg",
    summary:
      "זהו רומן היסטורי שעלילתו מתפצלת לשני קווים מקבילים, ומתפרשת מאוסטריה שלקראת מלחמת העולם השנייה ועד ללוס אנג’לס של שנות התשעים.",
    price: 120,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "מכתב שנשכח",
    author: "קתרין יוז",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2018/letter_master.jpg",
    summary:
      "טינה קרייג לא מוותרת על התנדבות שבועית בחנות הצדקה לבגדים משומשים. במנצ´סטר של שנות השבעים, זהו מקום המפלט היחיד שלה מהבית בו שוכב בעלה מעולף בסלון אחרי עוד לילה של שתייה לשוכרה. ",
    price: 95,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "יער הכוכבים הנמוגים",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/28119/forest_Master.jpg",
    summary:
      "יונה, שנולדה בשם אינגה, לא זוכרת הרבה מהוריה או מהעולם שמחוץ ליער. כשהיתה בת שנתיים, היא נגנבה מהוריה הגרמנים על ידי קשישה יהודייה בשם ירושה, שראתה את הנסתר וחשה שהיא חייבת לקחת את הילדה מחיק משפחתה אל היער.",
    price: 65,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "צופן דה וינצ׳י",
    author: "דן בראון",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2017/_master(21).jpg",
    summary:
      "בעת ביקור בפריז מקבל רוברט לנגדון, מומחה לסמלים, טלפון בהול בשעת לילה מאוחרת. האוצֵר הזקן של הלובר נרצח במוזיאון, וצופן סתום נמצא ליד גופתו. כשלנגדון מנסה לפענח את החידות המוזרות בעזרת מפענחת הצפנים סופי נווה, נדהמים שניהם לגלות שורה של רמזים ביצירותיו של דה וינצ'י, שהוסוו בחכמה על ידי הצייר.",
    price: 55,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "הגשרים של מחוז מדיסון",
    author: "רוברט ג'יימס וולר",
    image:
      "https://images-evrit.yit.co.il/Images/Products/covers_2019_b/medison_master.jpg",
    summary:
      "הגשרים של מחוז מדיסון מאת רוברט ג'יימס וולר ראה אור לראשונה ב-1992, והיה לתופעה. בתוך זמן קצר, הפך לאחד מרבי המכר הגדולים של המאה העשרים: 60 מיליון עותקים נמכרו ממנו ברחבי העולם, ב-40 שפות שונות. הספר כיכב במקום הראשון ברשימת רבי המכר של הניו-יורק טיימס, ונותר בה שלוש שנים ברציפות. והיה כמובן גם הסרט המצליח, בכיכובם של קלינט איסטווד ומריל סטריפ. ",
    price: 50,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "אורח באחוזת פארלי",
    author: "ריס בואן",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/32131/orech_beachozat_ferlie_Master.jpg",
    summary:
      "מלחמת העולם השנייה מגיעה לאחוזת פארלי, מקום מושבם של לורד וסטרהאם וחמש בנותיו, כאשר חייל עם מצנח פגום נופל אל מותו בשטחה. המדים והציוד שלו מעוררים חשד, וקצין MI5 וחבר המשפחה בן קרסוול לוקח על עצמו בחשאי את המשימה להכריע אם מדובר במרגל גרמני. המשימה גם מעניקה לו הזדמנות להימצא בקרבתה של פמלה, בתו האמצעית של לורד וסטרהאם, שבה הוא מאוהב בחשאי. אך לפמלה יש סוד משלה: היא התקבלה לעבודה בבלצ'לי פארק, מקום משכנה של היחידה הבריטית לפיצוח צפנים.",
    price: 76,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "ספר השמות האבודים",
    author: "קריסטין הרמל",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/24415/lostNames_Master.jpg",
    summary:
      "כשאווה טראוב אברמס, ספרנית על סף פרישה, מבחינה בוקר אחד בעיתון בתמונה של ספר שלא ראתה זה יותר משישים וחמש שנים – ספר השמות האבודים – מבטה קופא. מתברר שחוקרים מצאו את הספר ומתקשים לפענח את החידה הטמונה בו – חידה שרק אווה יודעת את פתרונה.",
    price: 68,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "דיו חיוור",
    author: "הרלן קובן",
    image:
      "https://images-evrit.yit.co.il/Images/Products/ebooks2/just_one_look_master.jpg",
    summary:
      "הרלן קובן, מחבר רבי-המכר עוצרי הנשימה הנעלמים וההזדמנות האחרונה, עושה זאת שוב, בספר שכבש בסערה את מצעדי המכירות בכל מקום בעולם שבו הופיע, וקיבע סופית את מעמדו של קובן כמלך הבלתי-מעורער של ספרות המתח האמריקאית. דיו חיוור הוא שם הלהיט הגדול של להקה שכמעט היתה לאגדה והתפרקה בנסיבות מסתוריות רגע לפני הפריצה קדימה. שנים רבות אחרי הקונצרט האחרון של הלהקה, שנגמר באסון, נסחפים חייהן של כמה דמויות למערבולת מסוכנת שאין ממנה מוצא. בעלה של גרייס לוסון נעלם.",
    price: 71,
    discount: 0
  },
  {
    id: nanoid(),
    bookName: "תמונות נסתרות",
    author: "ג׳ייסון רקולאק",
    image:
      "https://images-evrit.yit.co.il/Images/Products/NewBO/Products/28769/temunot_Master.jpg",
    summary:
      "תעלומה על צעירה שנאבקת בעברהּ, ועל ילד קטן עם סודות מוזרים ומטרידים. אחרי שנה וחצי במוסד גמילה, בעקבות תקרית טראגית והתמכרות למשככי כאבים, מלורי קווין נכונה לצאת ולפגוש את העולם שבחוץ. היא מתקבלת לעבודה כאומנת בביתם של טד וקרוליין, זוג צעיר ואמיד מאוד, הורים לטדי בן החמש.",
    price: 57,
    discount: 0
  },
];
